app/controllers/compartilhados_controller.rb

  def index
    @compartilhados = Compartilhado.all
---
SELECT `compartilhados`.* FROM `compartilhados`

  def show
    @users = User.all
    @user = @compartilhado.users.build
    @usuarios = @compartilhado.usuarios.where.not(id: nil)
    @compartilhados = Compartilhado.where(id: current_user.id).where.not(usuario_id: nil)
---
SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`compartilhado_id` = 1 AND `usuarios`.`id` IS NOT NULL
SELECT  `compartilhados`.* FROM `compartilhados` WHERE `compartilhados`.`id` = 1 LIMIT 1

  def create
    @compartilhado = Compartilhado.new(compartilhado_params)

    respond_to do |format|
      if @compartilhado.save
---
INSERT INTO `compartilhados` (`nome`, `user_id`, `created_at`, `updated_at`) VALUES ('Imagens', 1, '2018-09-30 22:14:24', '2018-09-30 22:14:24')

  def update
    respond_to do |format|
      if @compartilhado.update(compartilhado_params)
---
UPDATE `compartilhados` SET `updated_at` = '2018-09-30 22:31:35' WHERE `compartilhados`.`id` = 2

  def destroy
    @compartilhado.destroy
---
DELETE FROM `compartilhados` WHERE `compartilhados`.`id` = 1

    def set_compartilhado
      @compartilhado = Compartilhado.find(params[:id])
---
SELECT  `compartilhados`.* FROM `compartilhados` WHERE `compartilhados`.`id` = 1 LIMIT 1