app/controllers/roms_controller.rb

  def index
    @roms = Rom.all.where(user_id: current_user.id)
    @compartilhados = Compartilhado.joins(:usuarios).where(usuarios: {user_id: current_user.id})
---
SELECT `roms`.* FROM `roms` WHERE `roms`.`user_id` = 1
SELECT `compartilhados`.* FROM `compartilhados` INNER JOIN `usuarios` ON `usuarios`.`compartilhado_id` = `compartilhados`.`id` WHERE `usuarios`.`user_id` = 1

  def create
    @rom = Rom.new(rom_params)

    respond_to do |format|
      if @rom.save
---
INSERT INTO `roms` (`nome`, `user_id`, `created_at`, `updated_at`) VALUES ('Fotos', 1, '2018-09-30 22:13:57', '2018-09-30 22:13:57')

  def update
    respond_to do |format|
      if @rom.update(rom_params)
---
UPDATE `roms` SET `updated_at` = '2018-09-30 22:13:57' WHERE `roms`.`id` = 1

  def destroy
    @rom.destroy
---
DELETE FROM `roms` WHERE `roms`.`id` = 4

    def set_rom
      @rom = Rom.find(params[:id])
---
SELECT  `roms`.* FROM `roms` WHERE `roms`.`id` = 1 LIMIT 1