app/views/compartilhados/_usuario_fields.html.erb

SELECT `users`.* FROM `users` ORDER BY `users`.`nome` ASC
---
    <div class="col-lg-12">
      <%= f.collection_select :user_id, User.order(:nome).where.not(id: current_user.id), :id, :nome, prompt: 'Selecione' %>