app/views/compartilhados/show.html.erb

<strong>Usuarios Compartilhando:</strong><br>
<td><% @compartilhado.usuarios.each do |usuario| %>
---
SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`compartilhado_id` = 1 AND `usuarios`.`id` IS NOT NULL